In [1]:
# -*- coding: utf-8 -*-
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#    http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
# implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

# 10 Minutes to Pandas
Pandas documentation: https://pandas.pydata.org/pandas-docs/version/0.17.0/10min.html

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Series

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### DataFrame

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.915392 -0.046970 -0.159554 -1.177566
2013-01-02  1.500989 -0.474376  0.331578 -1.306295
2013-01-03  0.599363 -0.711976 -0.162885  0.376670
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171
2013-01-05 -0.925412 -1.124964 -0.210454  1.503136
2013-01-06  0.127855  0.090082  1.056026 -0.051941

### Creating a DataFrame by passing a dict of objects

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# Viewing data

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.915392 -0.046970 -0.159554 -1.177566
2013-01-02  1.500989 -0.474376  0.331578 -1.306295
2013-01-03  0.599363 -0.711976 -0.162885  0.376670
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171
2013-01-05 -0.925412 -1.124964 -0.210454  1.503136

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.925412 -1.124964 -0.210454  1.503136
2013-01-06  0.127855  0.090082  1.056026 -0.051941

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.176952 -0.502370  0.265168 -0.253528
std    1.116686  0.458278  0.536966  1.082583
min   -1.449113 -1.124964 -0.210454 -1.306295
25%   -0.922907 -0.737504 -0.162052 -1.099467
50%   -0.393768 -0.593176  0.086012 -0.458556
75%    0.481486 -0.153821  0.635115  0.269517
max    1.500989  0.090082  1.056026  1.503136

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Transposing data

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.915392    1.500989    0.599363   -1.449113   -0.925412    0.127855
B   -0.046970   -0.474376   -0.711976   -0.746014   -1.124964    0.090082
C   -0.159554    0.331578   -0.162885    0.736294   -0.210454    1.056026
D   -1.177566   -1.306295    0.376670   -0.865171    1.503136   -0.051941

# Data selection

**One column = Series**

In [13]:
df['A']

2013-01-01   -0.915392
2013-01-02    1.500989
2013-01-03    0.599363
2013-01-04   -1.449113
2013-01-05   -0.925412
2013-01-06    0.127855
Freq: D, Name: A, dtype: float64

**Slicing**

In [14]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.915392 -0.046970 -0.159554 -1.177566
2013-01-02  1.500989 -0.474376  0.331578 -1.306295
2013-01-03  0.599363 -0.711976 -0.162885  0.376670

**Selection by label**

In [15]:
df.loc[dates[0]]

A   -0.915392
B   -0.046970
C   -0.159554
D   -1.177566
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.915392 -0.046970
2013-01-02  1.500989 -0.474376
2013-01-03  0.599363 -0.711976
2013-01-04 -1.449113 -0.746014
2013-01-05 -0.925412 -1.124964
2013-01-06  0.127855  0.090082

**Selection by Position**

In [17]:
df.iloc[1,1]

-0.4743756597644039

In [18]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.449113 -0.746014
2013-01-05 -0.925412 -1.124964

**Boolean Indexing**

In [19]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.500989 -0.474376  0.331578 -1.306295
2013-01-03  0.599363 -0.711976 -0.162885  0.376670
2013-01-06  0.127855  0.090082  1.056026 -0.051941

In [20]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  1.500989       NaN  0.331578       NaN
2013-01-03  0.599363       NaN       NaN  0.376670
2013-01-04       NaN       NaN  0.736294       NaN
2013-01-05       NaN       NaN       NaN  1.503136
2013-01-06  0.127855  0.090082  1.056026       NaN

**Setting values by label**

In [21]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566
2013-01-02  1.500989 -0.474376  0.331578 -1.306295
2013-01-03  0.599363 -0.711976 -0.162885  0.376670
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171
2013-01-05 -0.925412 -1.124964 -0.210454  1.503136
2013-01-06  0.127855  0.090082  1.056026 -0.051941

# Missing Data

In [22]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566 NaN
2013-01-02  1.500989 -0.474376  0.331578 -1.306295 NaN
2013-01-03  0.599363 -0.711976 -0.162885  0.376670 NaN
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171 NaN

In [23]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566  1.0
2013-01-02  1.500989 -0.474376  0.331578 -1.306295  1.0
2013-01-03  0.599363 -0.711976 -0.162885  0.376670  NaN
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171  NaN

In [24]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566  1.0
2013-01-02  1.500989 -0.474376  0.331578 -1.306295  1.0

In [25]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566  1.0
2013-01-02  1.500989 -0.474376  0.331578 -1.306295  1.0
2013-01-03  0.599363 -0.711976 -0.162885  0.376670  5.0
2013-01-04 -1.449113 -0.746014  0.736294 -0.865171  5.0

**Boolean mask where values are NaN**

In [26]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# Operations

In [27]:
df.mean()

A   -0.024386
B   -0.502370
C    0.265168
D   -0.253528
dtype: float64

In [28]:
df.mean(1)

2013-01-01   -0.346023
2013-01-02    0.012974
2013-01-03    0.025293
2013-01-04   -0.581001
2013-01-05   -0.189423
2013-01-06    0.305506
Freq: D, dtype: float64

### Applying functions to the data

In [29]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000 -0.046970 -0.159554 -1.177566
2013-01-02  1.500989 -0.521345  0.172023 -2.483862
2013-01-03  2.100353 -1.233322  0.009139 -2.107192
2013-01-04  0.651239 -1.979335  0.745433 -2.972362
2013-01-05 -0.274172 -3.104300  0.534980 -1.469226
2013-01-06 -0.146317 -3.014218  1.591006 -1.521167

In [30]:
df.apply(lambda x: x.max() - x.min())

A    2.950103
B    1.215046
C    1.266480
D    2.809432
dtype: float64

# Merging data

## Concat

In [31]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.597450 -0.479064  0.477516 -1.290330
1  1.286573  0.539683 -0.322505 -0.149753
2  0.373064  0.493009 -0.077533  0.634335
3  1.893223  0.830770  0.823957  0.224853
4  1.276189 -0.690354  0.535130 -0.997944
5 -1.167314  0.737296 -0.155529 -0.635453
6  0.449858  0.404178  0.504562  0.223516
7  1.045490  0.678458 -0.604873  1.983036
8 -0.056518  0.952301  1.372340 -0.999127
9  1.212712 -0.510580  0.779354  1.078452

In [32]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.597450 -0.479064  0.477516 -1.290330
 1  1.286573  0.539683 -0.322505 -0.149753
 2  0.373064  0.493009 -0.077533  0.634335,
           0         1         2         3
 3  1.893223  0.830770  0.823957  0.224853
 4  1.276189 -0.690354  0.535130 -0.997944
 5 -1.167314  0.737296 -0.155529 -0.635453
 6  0.449858  0.404178  0.504562  0.223516,
           0         1         2         3
 7  1.045490  0.678458 -0.604873  1.983036
 8 -0.056518  0.952301  1.372340 -0.999127
 9  1.212712 -0.510580  0.779354  1.078452]

In [33]:
pd.concat(pieces)

          0         1         2         3
0 -0.597450 -0.479064  0.477516 -1.290330
1  1.286573  0.539683 -0.322505 -0.149753
2  0.373064  0.493009 -0.077533  0.634335
3  1.893223  0.830770  0.823957  0.224853
4  1.276189 -0.690354  0.535130 -0.997944
5 -1.167314  0.737296 -0.155529 -0.635453
6  0.449858  0.404178  0.504562  0.223516
7  1.045490  0.678458 -0.604873  1.983036
8 -0.056518  0.952301  1.372340 -0.999127
9  1.212712 -0.510580  0.779354  1.078452

## Join

In [34]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [35]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [36]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Append

In [37]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.118127  1.601157 -0.411809  0.079379
1  0.739660 -0.791931  0.289013 -1.106408
2  0.843389  1.376689  0.989169  0.949177
3  1.300951 -0.914936 -0.908591  0.258470
4 -0.775699 -0.547615  0.742676  0.355285
5  0.903116 -0.034560 -0.341619  0.244571
6  1.087881  0.766838 -0.715215 -0.000410
7  1.000132 -0.052059 -2.097786 -0.677608

In [38]:
s = df.iloc[3]
s

A    1.300951
B   -0.914936
C   -0.908591
D    0.258470
Name: 3, dtype: float64

In [39]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.118127  1.601157 -0.411809  0.079379
1  0.739660 -0.791931  0.289013 -1.106408
2  0.843389  1.376689  0.989169  0.949177
3  1.300951 -0.914936 -0.908591  0.258470
4 -0.775699 -0.547615  0.742676  0.355285
5  0.903116 -0.034560 -0.341619  0.244571
6  1.087881  0.766838 -0.715215 -0.000410
7  1.000132 -0.052059 -2.097786 -0.677608
8  1.300951 -0.914936 -0.908591  0.258470

## Grouping

In [40]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -2.451440 -2.049285
1  bar    one  0.181384 -0.665149
2  foo    two -0.992332 -0.236608
3  bar  three  0.839368 -2.626199
4  foo    two  0.834052 -0.422441
5  bar    two -0.560079 -1.716443
6  foo    one  1.195486 -0.804481
7  foo  three -0.685315 -0.614787

In [41]:
df.groupby('A').sum()

            C         D
A
bar  0.460674 -5.007791
foo -2.099548 -4.127602

In [42]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.181384 -0.665149
    three  0.839368 -2.626199
    two   -0.560079 -1.716443
foo one   -1.255954 -2.853766
    three -0.685315 -0.614787
    two   -0.158279 -0.659049

## Reshaping

### Stack

In [43]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [44]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [45]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.084960 -0.384604
      two     1.153522 -0.672991
baz   one     2.129051  0.183687
      two    -0.765501  0.425716
foo   one     0.139958  0.222828
      two     0.322007 -1.586583
qux   one    -2.328061  1.406325
      two     0.993682  0.408937

In [46]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.084960 -0.384604
      two     1.153522 -0.672991
baz   one     2.129051  0.183687
      two    -0.765501  0.425716

In [47]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.084960
               B   -0.384604
       two     A    1.153522
               B   -0.672991
baz    one     A    2.129051
               B    0.183687
       two     A   -0.765501
               B    0.425716
dtype: float64

**With a stacked DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:**

In [48]:
stacked.unstack()

                     A         B
first second
bar   one    -0.084960 -0.384604
      two     1.153522 -0.672991
baz   one     2.129051  0.183687
      two    -0.765501  0.425716

### Pivot Tables

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

# Time Series

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

In [ ]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

In [ ]:
ts.resample('5Min').sum()

In [ ]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')
ts_utc

# Categoricals

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

In [ ]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df["grade"]

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

In [ ]:
df.sort_values(by="grade")

In [ ]:
df.groupby("grade").size()

# Plotting

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts

In [ ]:
ts = ts.cumsum()
ts

In [ ]:
ts.plot()

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])
df

In [ ]:
df = df.cumsum()
df

In [ ]:
plt.figure() 
df.plot() 
plt.legend(loc='best')

# 100-pandas-puzzles: lohy bez rieenia + s rieenm 

**https://github.com/FIIT-IAU/100-pandas-puzzles**

(forked from https://github.com/ajcr/100-pandas-puzzles)

# lohy

V tejto asti v ak random dataset zznamov hrania hier. Jeden zznam pozozstva [id_hra, nzov hry] ,ktor nm hovor, e hr s id id_hra sputil (v nejakom ase) dan hru.

In [ ]:
hry = ["AssassinsCreed", "Borderlands", "Crysis", "Doom", "Witcher"]
data = pd.DataFrame({"Hrac" : np.random.randint(5, size=(1, 20))[0],
                    "Hra" : np.random.choice(hry, size=(1, 20))[0]})              
data

Vaou lohou je teraz vyfiltrova iba hrov, ktor hrali Crysis. Akceptovan je iba prkaz na jeden riadok.

In [ ]:
# Miesto pre v kd

Teraz z pvodnch dt (Dataframe 'data') spotajte koko hrov hralo jednotliv hru (pre kad hru poet hrov). Op sa akceptuje len jednoriadkov prkaz.

In [ ]:
# Miesto pre v kd

Chcem sa pozrie na jednotlivch hrov, koko krt hrali dan hru. Vytvorte nov tabuku, kde riadky bud hri, stpce bud hry a zznamy bud poty spusten hry hrom.

In [ ]:
# Miesto pre v kd

## Koronavrus!

V tejto lohe mte priraven dve srie dt. Prv s poet vykonanch testov a druh poet dennch prrastkov pozitvne testovanch osb na Slovensku od 6. 3. 2020 so 26. 9. 2020. Vaou lohou je teraz tieto dve srie zobrazi na jednom grafe.

In [ ]:
testy = pd.Series([378, 66, 76, 69, 111, 97, 95, 58, 197, 289, 159, 318, 225, 301, 368, 440, 242, 451, 476, 335, 913, 747, 720, 401, 688, 877, 1191, 1454, 1889, 1524, 1036, 1448, 2042, 1690, 2301, 2174, 1580, 1324, 1302, 1439, 2967, 3351, 3144, 3323, 2458, 2694, 3468, 4525, 3840, 4828, 4839, 3171, 1767, 5472, 4584, 5150, 3698, 1450, 1584, 2060, 4742, 5161, 4694, 3910, 1488, 786, 2063, 4326, 4876, 3992, 4084, 2476, 971, 2041, 3371, 2933, 2751, 2236, 1649, 645, 1464, 2839, 2352, 1848, 3433, 1606, 274, 6418, 2336, 2135, 1832, 2639, 1180, 160, 851, 1545, 1500, 1262, 1511, 479, 47, 847, 1163, 787, 806, 1278, 301, 41, 661, 1257, 936, 1515, 1611, 931, 62, 784, 2063, 1708, 1801, 2216, 808, 50, 873, 2225, 2284, 2172, 2879, 960, 279, 1163, 2205, 2336, 1862, 2161, 410, 24, 3333, 2571, 2251, 2049, 2275, 767, 216, 1548, 2296, 1851, 2176, 2884, 585, 766, 1320, 2538, 2667, 2473, 3099, 1068, 564, 1454, 3131, 2741, 2738, 3235, 2013, 481, 1583, 3684, 3435, 3245, 3833, 1723, 929, 2103, 4090, 3636, 4360, 4453, 1951, 588, 2763, 2428, 3519, 4772, 5947, 2462, 922, 2891, 5309, 5021, 4266, 6191, 3080, 1425, 4323, 3235, 4027, 5542, 5750, 3443, 1952, 2664, 6231, 5213, 5540, 6483, 5655])
prirastky = pd.Series([1, 2, 2, 2, 0, 3, 11, 11, 12, 17, 11, 24, 8, 19, 14, 41, 7, 19, 12, 10, 43, 23, 22, 22, 27, 37, 26, 24, 21, 14, 49, 47, 101, 19, 14, 13, 14, 27, 66, 28, 114, 72, 40, 72, 12, 26, 45, 81, 35, 13, 6, 2, 3, 7, 5, 7, 4, 1, 5, 8, 8, 16, 10, 0, 2, 0, 8, 4, 8, 3, 13, 1, 1, 0, 1, 6, 1, 1, 5, 2, 2, 2, 5, 0, 1, 0, 1, 0, 3, 1, 0, 2, 0, 2, 1, 2, 8, 1, 3, 3, 4, 0, 9, 1, 14, 10, 1, 1, 1, 18, 23, 13, 14, 7, 1, 2, 20, 13, 20, 29, 15, 1, 2, 31, 53, 19, 23, 8, 1, 6, 19, 24, 14, 11, 3, 1, 41, 37, 31, 29, 23, 38, 2, 23, 41, 20, 27, 45, 7, 10, 14, 49, 63, 43, 43, 30, 3, 16, 75, 49, 62, 54, 47, 5, 15, 100, 80, 123, 91, 40, 68, 28, 84, 90, 102, 114, 34, 41, 72, 53, 121, 137, 226, 88, 22, 91, 161, 178, 186, 201, 79, 48, 188, 92, 161, 235, 290, 131, 79, 175, 338, 360, 419, 552, 478])

In [ ]:
# Miesto pre v kd